In [1]:
import requests
import pandas as pd
import json
import os

In [10]:
topMovies = pd.read_csv('data/rawTopMovies.csv', encoding = 'utf-8') #utf-8: show foreign characters
topMovies.head()

,id,title,original_title,overview,release_date,original_language,vote_average,vote_count
0,19404,Dilwale Dulhania Le Jayenge,दिलवाले दुल्हनिया ले जायेंगे,"Raj is a rich, carefree, happy-go-lucky second...",1995-10-20,hi,9.1,1971
1,278,The Shawshank Redemption,The Shawshank Redemption,Framed in the 1940s for the double murder of h...,1994-09-23,en,8.6,12139
2,238,The Godfather,The Godfather,"Spanning the years 1945 to 1955, a chronicle o...",1972-03-14,en,8.6,9309
3,372058,Your Name.,君の名は。,High schoolers Mitsuha and Taki are complete s...,2016-08-26,ja,8.6,3576
4,324857,Spider-Man: Into the Spider-Verse,Spider-Man: Into the Spider-Verse,Miles Morales is juggling his life between bei...,2018-12-07,en,8.5,1470

In [2]:
api_key = '7f2da72d1711559a8d3c3eff5fae88d8'

In [28]:
companies = []
movies_companies=[]

# Get movie ID from the top movies download through TMDB API
for movieID in topMovies['id'][:40]:
    url = "https://api.themoviedb.org/3/movie/" + str(movieID) + "?api_key=" + api_key + "&language=en-US" 
    movieData = requests.get(url)
    production_companies = movieData.json()['production_companies']
    for production_company in production_companies:
        movie_company = dict.fromkeys(['movieID', 'companyID'])
        company = dict.fromkeys(['id', 'name', 'origin_country'])
        movie_company['movieID'] = movieID
        movie_company['companyID'] = production_company['id']
        for key in production_company.keys():
            if key in company.keys():
                company[key] = production_company[key]
        companies.append(company)
        movies_companies.append(movie_company)

In [29]:
companiesDataFrame = pd.DataFrame(companies)

In [30]:
companiesDataFrame.head()

      id                       name origin_country
0   1569             Yash Raj Films             IN
1     97  Castle Rock Entertainment             US
2    174      Warner Bros. Pictures             US
3      4                  Paramount             US
4  10211         Alfran Productions             US

In [31]:
movies_companies = pd.DataFrame(movies_companies)

In [32]:
movies_companies.head()

   companyID  movieID
0       1569    19404
1         97      278
2        174      278
3          4      238
4      10211      238

In [33]:
companiesDataFrame['id'].is_unique

False

In [37]:
companiesDataFrame.drop_duplicates(subset=['id'], inplace=True)

In [38]:
companiesDataFrame['id'].is_unique

True

In [34]:
movies_companies['movieID'].is_unique

False

In [42]:
companiesDataFrame.to_csv('data/companies.csv', encoding='utf-8', index=False)

In [40]:
movies_companies.to_csv('data/movies_companies.csv', encoding='utf-8')

In [41]:
companiesDataFrame.head()

      id                       name origin_country
0   1569             Yash Raj Films             IN
1     97  Castle Rock Entertainment             US
2    174      Warner Bros. Pictures             US
3      4                  Paramount             US
4  10211         Alfran Productions             US